src/InformationRegisters/рнсОбщиеНастройки/рнсОбщиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рнсОбщиеНастройки</name>
  <resources>
    <name>Настройки</name>
    <comment>Настройки</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение3</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение4</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение5</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.рнсРазделыОбщихНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>CatalogRef.рнсКлючиОбщихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/рнсКлючиОбщихНастроек/рнсКлючиОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсКлючиОбщихНастроек</name>
  <owners>Catalog.рнсРазделыОбщихНастроек</owners>
  <tabularSections>
    <name>ЗначенияКлюча</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗаполнениеЗаявкиДС</name>
      <description>Заполнение заявки ДС</description>
    </items>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
    <items>
      <name>ОповещниеОбИзмненеиях</name>
      <description>Оповещние об измненеиях</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfCharacteristicTypes/рнсТипыРасширенныхНастроек/рнсТипыРасширенныхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>рнсТипыРасширенныхНастроек</name>
  <type>
    <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
    <types>CatalogRef.рнсПравилоИнициализацииДанных</types>
    <types>Boolean</types>
    <types>CatalogRef.рнсПравилаОписанияВстроенныхДокументов</types>
    <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>128</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Индекс</name>
      <description>Индекс</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>НастройкиППД</name>
      <description>Настройки ППД</description>
      <type>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
      </type>
    </items>
    <items>
      <name>ППД</name>
      <description>Правила получение данных</description>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
      </type>
    </items>
    <items>
      <name>ПравилоИнициализацииДанных</name>
      <description>Правило инициализации данных</description>
      <type>
        <types>CatalogRef.рнсПравилоИнициализацииДанных</types>
      </type>
    </items>
    <items>
      <name>СтатусыЗаявокНаРасходованиеДенежныхСредств</name>
      <description>Статусы заявок на расходование денежных средств</description>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
        <types>CatalogRef.рнсПравилоИнициализацииДанных</types>
        <types>Boolean</types>
        <types>CatalogRef.рнсПравилаОписанияВстроенныхДокументов</types>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Строка</name>
      <description>Строка</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/InformationRegisters/рнсОбщиеНастройки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗапросОбщиеНастройки(Раздел, Секция = Неопределено, ОписаниеКлюча = Неопределено, Дополнительно = Неопределено) Экспорт
	
	Результат 						= Новый Запрос;  
	ОтборПоПолямКлюча				= Ложь; 
	ОтборПоКлючу					= Ложь;	
	КоличествоПолейКлюча 			= 0;  	 
	ОписаниеПолейКлюча				= Новый Массив;  
	ДополнительныеПараметры			= Новый Структура("Колонки, ИмяВременнойТаблицы, Первые1", 7, Неопределено, Ложь);  
	МассивОтборов					= Новый Массив; 
	МассивСоединений				= Новый Массив; 
	МассивКолонокВыбор 				= Новый Массив;	
	ШаблонВыборКолонки 				= "ТаблицаНастроек.%1 КАК %1";    
	ШаблонВыборПолеКлюча 			= "ТаблицаПолейКлюча%1.Значение КАК %2";
	ШаблонОтбора					= "ТаблицаПолейКлюча%1.Значение = &ЗначениеОтбора%1"; 
	ШаблонСоединения				= "ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рнсКлючиОбщихНастроек.ЗначенияКлюча КАК ТаблицаПолейКлюча%1
										|		ПО ТаблицаНастроек.Ключ = ТаблицаПолейКлюча%1.Ссылка
										|			И (ТаблицаПолейКлюча%1.НомерСтроки = %1)"; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ТекстЗапросаВыбор
	|ПОМЕСТИТЬ Вт_Настройки
	|ИЗ
	|	РегистрСведений.рнсОбщиеНастройки КАК ТаблицаНастроек
	|		&ТекстСоеднинений
	|ГДЕ
	|	НЕ ТаблицаНастроек.Отключено
	|	И ТаблицаНастроек.Раздел = &Раздел 	
	|	И &ТекстОтбора";	
	
	Если ЗначениеЗаполнено(ОписаниеКлюча) Тогда
		Если ТипЗнч(ОписаниеКлюча) = Тип("Структура") Тогда 
			ОтборПоПолямКлюча = Истина;
		Иначе 
			ОтборПоКлючу = Истина;		
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дополнительно)  Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Дополнительно);	
	КонецЕсли; 	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ТекстЗапросаРаздела();		
	
	Запрос.УстановитьПараметр("ПустойТипЗначения", ПланыВидовХарактеристик.рнсТипыРасширенныхНастроек.ПустаяСсылка());
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	ВыборкаРаздел 		= РезультатЗапроса.Выбрать();
	
	ВыборкаРаздел.Следующий(); 
	
	КолонкаРаздел 		= ПроверитьБит(ДополнительныеПараметры.Колонки, 0); 
	КолонкаСекция 		= ПроверитьБит(ДополнительныеПараметры.Колонки, 1) И ВыборкаРаздел.ИспользоватьСекцииРаздела; 
	КолонкаПоляКлюча 	= ПроверитьБит(ДополнительныеПараметры.Колонки, 2) И ВыборкаРаздел.ИспользоватьКлючНастройки;
	КолонкаХранилище	= ВыборкаРаздел.ИспользуетсяХранилищеЗначения;
		
	Если ВыборкаРаздел.ИспользоватьКлючНастройки Тогда
		
		Выборка = ВыборкаРаздел.НастройкаКлюча.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			
			НПП 				= Выборка.НомерСтроки; 
			ТипЗначения 		= Выборка.ТипЗначения; 
			Идентификатор 		= Выборка.Идентификатор;  
			ЗначениеОтбора		= Неопределено;
			ЕстьОтбор 			= Ложь;
			
			Если ОтборПоПолямКлюча Тогда 				
				Если ЗначениеЗаполнено(Выборка.Идентификатор) И ОписаниеКлюча.Свойство(Выборка.Идентификатор, ЗначениеОтбора) Тогда 					
					ЕстьОтбор = Истина;  					
					Результат.УстановитьПараметр("ЗначениеОтбора" + НПП, ЗначениеОтбора); 
					МассивОтборов.Добавить(СтрШаблон(ШаблонОтбора, НПП));
				КонецЕсли;    			
			КонецЕсли; 	
			
			Если КолонкаПоляКлюча Тогда 		
				Псевдоним = ?(ЗначениеЗаполнено(Идентификатор), Идентификатор, "ПолеКлюча" + НПП);
				МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборПолеКлюча, НПП, Псевдоним));				
			КонецЕсли;  
			
			Если КолонкаПоляКлюча ИЛИ ЕстьОтбор Тогда
				МассивСоединений.Добавить(СтрШаблон(ШаблонСоединения, НПП));	
			КонецЕсли;
			
			КоличествоПолейКлюча = КоличествоПолейКлюча + 1; 			
			
		КонецЦикла;
		
	КонецЕсли;		
	
	Если КолонкаРаздел Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Раздел"));		
	КонецЕсли; 
	
	Если КолонкаСекция Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Секция"));	
	КонецЕсли; 	
	
	Если КолонкаПоляКлюча Тогда 
		
		МассивКолонокВыбор.Добавить("ТаблицаНастроек.Ключ КАК Ключ");  	
		
		Если КоличествоПолейКлюча = 0 Тогда 		
			МассивКолонокВыбор.Добавить("ПРЕДСТАВЛЕНИЕ(ТаблицаНастроек.Ключ) КАК ПредставлениеКлюча");
		КонецЕсли; 
		
	КонецЕсли;
	
	Для Сч = 1 По 5 Цикл
		Если ВыборкаРаздел["ЕстьЗначение" + Сч] Тогда
			МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Значение" + Сч));	
		КонецЕсли;	
	КонецЦикла; 	
	
	Если КолонкаХранилище Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Настройки"));	
	КонецЕсли;  	 	
	
	Если ЗначениеЗаполнено(Секция) И ВыборкаРаздел.ИспользоватьСекцииРаздела Тогда	
		МассивОтборов.Добавить("ТаблицаНастроек.Секция = &Секция"); 
		Результат.УстановитьПараметр("Секция", Секция);
	КонецЕсли;    
	
	Если ОтборПоКлючу Тогда
		
		Если ТипЗнч(ОписаниеКлюча) = Тип("СправочникСсылка.рнсКлючиОбщихНастроек") Тогда
			МассивОтборов.Добавить("ТаблицаНастроек.Ключ = &Ключ");	
			ЗначениеКлюча = ОписаниеКлюча;
		Иначе
			МассивОтборов.Добавить("ТаблицаНастроек.Ключ.Наименование = &Ключ");
			ЗначениеКлюча = Строка(ОписаниеКлюча);
		КонецЕсли;
		
		Результат.УстановитьПараметр("Ключ", ЗначениеКлюча);
		
	КонецЕсли;	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВыбор", СтрСоединить(МассивКолонокВыбор, ", " + Символы.ПС));
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Вт_Настройки", ДополнительныеПараметры.ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ Вт_Настройки", "");	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(МассивСоединений) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстСоеднинений", СтрСоединить(МассивСоединений, Символы.ПС));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстСоеднинений", "");	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивОтборов) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтбора", СтрСоединить(МассивОтборов, Символы.ПС + " И "));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтбора", "ИСТИНА");	
	КонецЕсли;  	
	
	Результат.Текст = ТекстЗапроса;   
	
	Результат.УстановитьПараметр("Раздел", Раздел);	  
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРаздела()
	
	Результат = "ВЫБРАТЬ
		|	рнсРазделыОбщихНастроек.ИспользоватьСекцииРаздела КАК ИспользоватьСекцииРаздела,
		|	рнсРазделыОбщихНастроек.ИспользоватьКлючНастройки КАК ИспользоватьКлючНастройки,
		|	рнсРазделыОбщихНастроек.ИмяФормыЗаполненияХранилища <> """" КАК ИспользуетсяХранилищеЗначения,
		|	рнсРазделыОбщихНастроек.ТипЗначения1 <> &ПустойТипЗначения КАК ЕстьЗначение1,
		|	рнсРазделыОбщихНастроек.ТипЗначения2 <> &ПустойТипЗначения КАК ЕстьЗначение2,
		|	рнсРазделыОбщихНастроек.ТипЗначения3 <> &ПустойТипЗначения КАК ЕстьЗначение3,
		|	рнсРазделыОбщихНастроек.ТипЗначения4 <> &ПустойТипЗначения КАК ЕстьЗначение4,
		|	рнсРазделыОбщихНастроек.ТипЗначения5 <> &ПустойТипЗначения КАК ЕстьЗначение5,
		|	рнсРазделыОбщихНастроек.НастройкаКлюча.(
		|		ПолеКлюча КАК ПолеКлюча,
		|		ПолеКлюча.ТипЗначения КАК ТипЗначения,
		|		НомерСтроки КАК НомерСтроки,
		|		ПолеКлюча.Идентификатор КАК Идентификатор
		|	) КАК НастройкаКлюча
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек КАК рнсРазделыОбщихНастроек
		|ГДЕ
		|	рнсРазделыОбщихНастроек.Ссылка = &Раздел";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
